# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке

# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам


def rhythm_search(poem):
    list_of_strings = poem.lower().split()
    sum_of_vowels = lambda x: sum(1 for i in x if i in 'аеёиоуыэюя')
    if all([sum_of_vowels(i) == sum_of_vowels(list_of_strings[0]) for i in list_of_strings]):
        return 'Парам пам-пам'
    return 'Пам парам'


print(rhythm_search("пара-ра-рам рам-пам-папам па-ра-па-дам"))
print(rhythm_search("пара-ра-рам-там рам-пам-папам па-ра-па-дам"))
